EDT/УТ/src/Documents/НаборнаяВедомостьДляВозврата/НаборнаяВедомостьДляВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаборнаяВедомостьДляВозврата</name>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВозврата</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВозврата</name>
    <comment>Не использовать(Устарело)</comment>
    <type>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйМеханизм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузкиСоздан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вскрытые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Магистраль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратПоставщику</name>
    <type>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПоТоварам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерепроверкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокВнутреннееПеремещение</name>
    <type>
      <types>DocumentRef.ВнутреннееПеремещениеЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВозврата</name>
    <type>
      <types>CatalogRef.ТипыВозврата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМестТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.СтатусыСкладскогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНайден</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаНеВозвратныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладМагазина</name>
      <type>
        <types>CatalogRef.СкладыМагазинов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СобраноМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказУдаленИзОтправки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПодтвержденКСборке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СобранЧастично</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ЗаказРеализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСкладскогоУчета</name>
      <type>
        <types>CatalogRef.СтатусыСкладскогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПроект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозвратТоваровОтПокупателя</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВозврата</name>
      <type>
        <types>EnumRef.ПричинаВозврата</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеНайденНаТСД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытиеЗаказов</name>
      <type>
        <types>DocumentRef.ЗакрытиеЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМестТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладМагазина</name>
      <type>
        <types>CatalogRef.СкладыМагазинов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНоменклатуры</name>
      <type>
        <types>CatalogRef.ШтрихкодыТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКТовара</name>
      <type>
        <types>CatalogRef.ШтрихкодыТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаказа</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МестаПоЗаказам</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаказа</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подтверждено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеопознанныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛогСканированияШК</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучнойВвод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнесистемныйВозврат</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/НаборнаяВедомостьДляВозврата/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаборнаяВедомостьДляВозврата.Дата КАК Дата,
	|	НаборнаяВедомостьДляВозврата.ИнтернетМагазин КАК ИнтернетМагазин,
	|	НаборнаяВедомостьДляВозврата.Номер КАК Номер,
	|	НаборнаяВедомостьДляВозврата.Заказы.(
	|		Заказ.Номер КАК НомерЗаказа,
	|		Заказ.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	|		КоличествоМестТовара КАК КоличествоМестТовара,
	|		НомерСтроки КАК НомерСтроки,
	|		Заказ КАК Заказ,
	|		Заказ.ТерминалДоставки.Наименование КАК ТерминалДоставки
	|	) КАК Заказы,
	|	НаборнаяВедомостьДляВозврата.Товары.(
	|		Сумма КАК Сумма,
	|		ЗаказРеализация КАК Заказ
	|	) КАК Товары
	|ИЗ
	|	Документ.НаборнаяВедомостьДляВозврата КАК НаборнаяВедомостьДляВозврата
	|ГДЕ
	|	НаборнаяВедомостьДляВозврата.Ссылка В(&Ссылка)
	|	И НЕ НаборнаяВедомостьДляВозврата.ТипВозврата В (ЗНАЧЕНИЕ(Справочник.ТипыВозврата.ВнесистемныйВозврат))";
	//Асеев 20.05.2022 (Задача № 4809)>>>
	//И НЕ НаборнаяВедомостьДляВозврата.ТипВозврата В (ЗНАЧЕНИЕ(Справочник.ТипыВозврата.ВнесистемныйВозврат))
	//Асеев 20.05.2022 (Задача № 4809)<<<
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
    
    ОбластьШтрихКод = Макет.ПолучитьОбласть("ШтрихКод");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаказыШапка = Макет.ПолучитьОбласть("ЗаказыШапка");
	ОбластьЗаказы = Макет.ПолучитьОбласть("Заказы");
	ОбластьЗаказыИтого = Макет.ПолучитьОбласть("ЗаказыИтог");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
    //Считаем количество мест
    КоличествоМестИтого = 0;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        ШтрихКод = lem.глСформироватьБарКодEAN13(smv.СформироватьШтрихкод(Выборка.Номер));
        ОбластьШтрихКод.Параметры.ШтрихКод = ШтрихКод;
		ТабДок.Вывести(ОбластьШтрихКод);
        
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

        ТабДок.Вывести(ОбластьЗаказыШапка);
        ВыборкаЗаказы = Выборка.Заказы.Выбрать();
        ТаблицаЗаказы = Выборка.Заказы.Выгрузить();
        ТаблицаТовары = Выборка.Товары.Выгрузить();
        Пока ВыборкаЗаказы.Следующий() Цикл
        	ОбластьЗаказы.Параметры.Заполнить(ВыборкаЗаказы);
            ОбластьЗаказы.Параметры.СуммаДокумента = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(ВыборкаЗаказы.НомерЗаказа).СуммаДокумента;
            //Серегин М.В. 07.08.2015 17:00:53 костылик )))
            Если Ссылка[0].СтатусВозврата=Справочники.СтатусыСкладскогоУчета.Возврат1 
                И 
                (Ссылка[0].ИнтернетМагазин = Справочники.Контрагенты.НайтиПоКоду("Shop_181") ИЛИ Ссылка[0].ИнтернетМагазин = Справочники.Контрагенты.НайтиПоКоду("Shop_227")) Тогда
                
                КоличествоМест = ПолучитьКоличествоМест(ВыборкаЗаказы.НомерЗаказа);
                ОбластьЗаказы.Параметры.КоличествоМест = КоличествоМест;
				//Асеев 09.10.2020 (по письму Re: Наборная ведомость на возврат)>>>
				ОбластьЗаказы.Параметры.ТерминалДоставки = ВыборкаЗаказы.ТерминалДоставки;
				//Асеев 09.10.2020 (по письму Re: Наборная ведомость на возврат)<<<
				
                КоличествоМестИтого = КоличествоМестИтого+КоличествоМест;
                
            Иначе
                
                ОбластьЗаказы.Параметры.КоличествоМест = ВыборкаЗаказы.КоличествоМестТовара;
                КоличествоМестИтого = КоличествоМестИтого+ВыборкаЗаказы.КоличествоМестТовара;
            КонецЕсли;
            //Серегин М.В. 07.08.2015 17:12:04 
        	ТабДок.Вывести(ОбластьЗаказы, ВыборкаЗаказы.Уровень());
        КонецЦикла;
        ////Серегин М.В. 07.08.2015 17:02:13 старый код
        //ОбластьЗаказыИтого.Параметры.КоличествоМест = ТаблицаЗаказы.Итог("КоличествоМестТовара");
        //Серегин М.В. 07.08.2015 17:02:21 новый
        ОбластьЗаказыИтого.Параметры.КоличествоМест = КоличествоМестИтого;
        ОбластьЗаказыИтого.Параметры.СуммаДокумента = ТаблицаТовары.Итог("Сумма");
        ТабДок.Вывести(ОбластьЗаказыИтого);
        
        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
	//}}
КонецПроцедуры

Функция ПолучитьКоличествоМест(НомерЗаказа)

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   СУММА(Накладная003Заказы.КоличествоМест) КАК КоличествоМест,
        |   Накладная003Заказы.НомерЗаказа
        |ИЗ
        |   Документ.Накладная003.Заказы КАК Накладная003Заказы
        |ГДЕ
        |   Накладная003Заказы.НомерЗаказа = &НомерЗаказа
        |
        |СГРУППИРОВАТЬ ПО
        |   Накладная003Заказы.НомерЗаказа";
    
    Запрос.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        Возврат ВыборкаДетальныеЗаписи.КоличествоМест;    
    Иначе
        Возврат 0;
    КонецЕсли;

КонецФункции // ПолучитьКоличествоМест()

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда	
		Если Параметры.Свойство("Ключ") И Параметры.Ключ.НовыйМеханизм Тогда	
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаДокументаНовая";					
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПечатьПредварительная(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьПредварительная)
	Макет = Документы.НаборнаяВедомостьДляВозврата.ПолучитьМакет("ПечатьПредварительная");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаборнаяВедомостьДляВозврата.Дата КАК Дата,
	|	НаборнаяВедомостьДляВозврата.ИнтернетМагазин КАК ИнтернетМагазин,
	|	НаборнаяВедомостьДляВозврата.Номер КАК Номер,
	|	НаборнаяВедомостьДляВозврата.Заказы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Заказ КАК Заказ,
	|		КоличествоМестТовара КАК КоличествоМестТовара,
	|		ТекущийСтатус КАК ТекущийСтатус,
	|		ЗаказНайден КАК ЗаказНайден,
	|		ТипЗаказа КАК ТипЗаказа,
	|		СкладМагазина КАК СкладМагазина,
	|		Контрагент КАК Контрагент,
	|		СобраноМест КАК СобраноМест
	|	) КАК Заказы
	|ИЗ
	|	Документ.НаборнаяВедомостьДляВозврата КАК НаборнаяВедомостьДляВозврата
	|ГДЕ
	|	НаборнаяВедомостьДляВозврата.Ссылка В(&Ссылка)
	|	И НЕ НаборнаяВедомостьДляВозврата.ТипВозврата В (ЗНАЧЕНИЕ(Справочник.ТипыВозврата.ВнесистемныйВозврат))";
	//Асеев 20.05.2022 (Задача № 4809)>>>
	//И НЕ НаборнаяВедомостьДляВозврата.ТипВозврата В (ЗНАЧЕНИЕ(Справочник.ТипыВозврата.ВнесистемныйВозврат))
	//Асеев 20.05.2022 (Задача № 4809)<<<
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаказыШапка = Макет.ПолучитьОбласть("ЗаказыШапка");
	ОбластьЗаказы = Макет.ПолучитьОбласть("Заказы");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЗаказыШапка);
		ВыборкаЗаказы = Выборка.Заказы.Выбрать();
		Пока ВыборкаЗаказы.Следующий() Цикл
			ОбластьЗаказы.Параметры.Заполнить(ВыборкаЗаказы);
			ТабДок.Вывести(ОбластьЗаказы, ВыборкаЗаказы.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
